Рабочая.Задачи2/src/AccumulationRegisters/ЦБР_СогласованоЗакрытоЧасов/ЦБР_СогласованоЗакрытоЧасов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ЦБР_СогласованоЗакрытоЧасов</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Согласовано</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Закрыто</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Выполнено</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>СтатусЗадачиБезРеализации</name>
    <type>
      <types>EnumRef.ЦБР_СтатусыЗадачиБезРеализации</types>
    </type>
  </attributes>
  <dimensions>
    <name>ПодразделениеИсполнителя</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПодразделениеПостановщика</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Задача</name>
    <type>
      <types>CatalogRef.ЦБР_Задача</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Постановщик</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидЧаса</name>
    <type>
      <types>EnumRef.ЦБР_ВидыЧасовПоЗадачам</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Реализация</name>
    <type>
      <types>DocumentRef.cbr_РеализацияТоваровУслугУПР</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Рабочая.Задачи2/src/Enums/ЦБР_ВидыЧасовПоЗадачам/ЦБР_ВидыЧасовПоЗадачам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ЦБР_ВидыЧасовПоЗадачам</name>
  <enumValues>
    <name>ИТС</name>
  </enumValues>
  <enumValues>
    <name>Установка</name>
  </enumValues>
  <enumValues>
    <name>Платные</name>
  </enumValues>
  <enumValues>
    <name>Бесплатные</name>
  </enumValues>
  <enumValues>
    <name>Демо</name>
  </enumValues>
</mdclass:Enum>

Рабочая.Задачи2/src/Catalogs/ЦБР_ГруппыСотрудников/ЦБР_ГруппыСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЦБР_ГруппыСотрудников</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Руководитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Состав</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Недействителен</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Разработчик</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Аналитик</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Рабочая.Задачи2/src/Catalogs/ЦБР_ЗаписиРабочегоКалендаря/ЦБР_ЗаписиРабочегоКалендаря.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЦБР_ЗаписиРабочегоКалендаря</name>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВесьДень</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидРаботы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаПовторения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияПовторения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаданиеСсылка</name>
    <type>
      <types>DocumentRef.ЦБР_Задание</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗадачаСсылка</name>
    <type>
      <types>CatalogRef.ЦБР_Задача</types>
    </type>
  </attributes>
  <attributes>
    <name>ИнтервалПовторения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПовторов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МультиОС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПовторениеПоДнямМесяца</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПовторениеПоМесяцам</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПравилоОкончанияПовторения</name>
    <comment>Удалить</comment>
    <type>
      <types>EnumRef.ЦБР_ПравилаОкончанияПовторения</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаОтмены</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Результат</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Связанная</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СобытиеДобавленно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостоянияЗаписейРабочегоКалендаря</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗаписиКалендаря</name>
    <type>
      <types>EnumRef.ТипЗаписиКалендаря</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалосьРешитьПриПодключенииПометка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧастотаПовторения</name>
    <type>
      <types>EnumRef.ЦБР_ЧастотаПовторения</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоСтартИзЗадания</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Цвет</name>
    <type>
      <types>EnumRef.ЦБР_ЦветаРабочегоКалендаря</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.ЦБР_СтатусЗаписиКалендаря</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ИсключенияПовторения</name>
    <attributes>
      <name>ДатаИсключения</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗаписьИсключения</name>
      <type>
        <types>CatalogRef.ЦБР_ЗаписиРабочегоКалендаря</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПовторениеПоДням</name>
    <attributes>
      <name>ДеньНедели</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерВхождения</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Рабочая.Задачи2/src/CommonModules/ЦБР_УчетТрудозатрат/Module.bsl
#Область ПрограммныйИнтерфейс 

Процедура РасчитатьЭффективностьСотрудника() Экспорт
	ПолучитьДействияСотрудников();
КонецПроцедуры

#КонецОбласти 

#Область СлужебныеФункцииИПроцедуры

Процедура ПолучитьДействияСотрудников()
	
	ГрафикРаботы = ЦБР_ЗадачиЗаданияВызовСервера.ПолучитьГрафикРаботы();
	РабочиеДаты = ЦБР_ЗадачиЗаданияВызовСервера.СформироватьТаблицуРабочегоВремени(ГрафикРаботы, ТекущаяДатаСеанса() - 30 * 24 * 3600, ТекущаяДатаСеанса());
	
	ТаблицаДат = Новый ТаблицаЗначений;
	ТаблицаДат.Колонки.Добавить("Сотрудник", Новый ОписаниеТипов("СправочникСсылка.Пользователи", , , ));
	ТаблицаДат.Колонки.Добавить("ДатаНачалаОС", Новый ОписаниеТипов("Дата", , , Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя)));
	ТаблицаДат.Колонки.Добавить("ДатаОкончанияОС", Новый ОписаниеТипов("Дата", , , Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя)));
	ТаблицаДат.Колонки.Добавить("РабочийДень", Новый ОписаниеТипов("Дата", , , Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя)));
	ТаблицаДат.Колонки.Добавить("ДлительностьРабочегоДня", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2, ДопустимыйЗнак.Любой)));
	
	Для Каждого Стр Из РабочиеДаты Цикл 
		Стр.ДатаНачала = НачалоДня(Стр.ДатаНачала);
	КонецЦикла;
	
	РабочиеДаты.Свернуть("ДатаНачала", "Длительность");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(РабочиеДни.ДатаНачала, ДЕНЬ) КАК РабочийДень,
	|	РабочиеДни.Длительность КАК ДлительностьРабочегоДня
	|ПОМЕСТИТЬ ВТ_РабочиеДни
	|ИЗ
	|	&РабочиеДни КАК РабочиеДни
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЦБР_ГруппыСотрудниковСостав.Пользователь КАК Пользователь,
	|	ВТ_РабочиеДни.РабочийДень КАК РабочийДень,
	|	ВТ_РабочиеДни.ДлительностьРабочегоДня КАК ДлительностьРабочегоДня
	|ПОМЕСТИТЬ ВТ_Сотрудники
	|ИЗ
	|	Справочник.ЦБР_ГруппыСотрудников.Состав КАК ЦБР_ГруппыСотрудниковСостав
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РабочиеДни КАК ВТ_РабочиеДни
	|		ПО (ИСТИНА)
	|ГДЕ
	|	ЦБР_ГруппыСотрудниковСостав.Недействителен = ЛОЖЬ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЦБР_ЗаписиРабочегоКалендаря.Ссылка КАК Ссылка,
	|	ЕСТЬNULL(ЦБР_ЗаписиРабочегоКалендаря.ДатаОкончания, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаОкончанияОС,
	|	ЕСТЬNULL(ЦБР_ЗаписиРабочегоКалендаря.ДатаНачала, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаНачалаОС,
	|	ВТ_Сотрудники.РабочийДень КАК РабочийДень,
	|	ВТ_Сотрудники.Пользователь КАК Сотрудник,
	|	ВТ_Сотрудники.ДлительностьРабочегоДня КАК ДлительностьРабочегоДня
	|ИЗ
	|	ВТ_Сотрудники КАК ВТ_Сотрудники
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЦБР_ЗаписиРабочегоКалендаря КАК ЦБР_ЗаписиРабочегоКалендаря
	|		ПО ВТ_Сотрудники.Пользователь = ЦБР_ЗаписиРабочегоКалендаря.Пользователь
	|			И (ВТ_Сотрудники.РабочийДень = НАЧАЛОПЕРИОДА(ЦБР_ЗаписиРабочегоКалендаря.ДатаНачала, ДЕНЬ))
	|
	|УПОРЯДОЧИТЬ ПО
	|	РабочийДень
	|ИТОГИ ПО
	|	Сотрудник";
	Запрос.УстановитьПараметр("РабочиеДни", РабочиеДаты);
	
	Результат = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Для Каждого Стр Из Результат.Строки Цикл
		Сотрудник = Стр.Сотрудник;
		
		БылиИзменения = Истина;
		Пока БылиИзменения Цикл
			ПересчитатьТаблицуВремени(БылиИзменения, ТаблицаДат, Стр.Строки, Сотрудник);
		КонецЦикла;
		
	КонецЦикла;
	
	ТаблицаДат.Колонки.Добавить("РазницаВСекундах", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2, ДопустимыйЗнак.Любой)));
	
	Для Каждого Строка Из ТаблицаДат Цикл
		Если ЗначениеЗаполнено(Строка.ДатаОкончанияОС) И ЗначениеЗаполнено(Строка.ДатаНачалаОС) Тогда  
			Строка.РазницаВСекундах = Строка.ДатаОкончанияОС - Строка.ДатаНачалаОС;
		КонецЕсли;
	КонецЦикла;
	
	ТаблицаДат.Свернуть("Сотрудник, РабочийДень, ДлительностьРабочегоДня", "РазницаВСекундах");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаДат.Сотрудник КАК Сотрудник,
	|	ТаблицаДат.РабочийДень КАК РабочийДень,
	|	ТаблицаДат.ДлительностьРабочегоДня КАК ДлительностьРабочегоДня,
	|	ТаблицаДат.РазницаВСекундах КАК РазницаВСекундах
	|ПОМЕСТИТЬ ВТ_ТаблицаДат
	|ИЗ
	|	&ТаблицаДат КАК ТаблицаДат
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЦБР_СогласованоЗакрытоЧасов.Согласовано КАК ЭффективныеЧасы,
	|	ВТ_ТаблицаДат.Сотрудник КАК Сотрудник,
	|	ВТ_ТаблицаДат.РабочийДень КАК РабочийДень,
	|	ВТ_ТаблицаДат.РазницаВСекундах КАК РабочиеЧасы
	|ИЗ
	|	ВТ_ТаблицаДат КАК ВТ_ТаблицаДат
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЦБР_СогласованоЗакрытоЧасов КАК ЦБР_СогласованоЗакрытоЧасов
	|		ПО ВТ_ТаблицаДат.Сотрудник = ЦБР_СогласованоЗакрытоЧасов.Исполнитель
	|			И (ВТ_ТаблицаДат.РабочийДень = НАЧАЛОПЕРИОДА(ЦБР_СогласованоЗакрытоЧасов.Период, ДЕНЬ))
	|ИТОГИ ПО
	|	Сотрудник";
	Запрос.УстановитьПараметр("ТаблицаДат", ТаблицаДат);
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаСотрудник = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаСотрудник.Следующий() Цикл	 
		
		Выборка = ВыборкаСотрудник.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			МенеджерЗаписи = РегистрыСведений.ЦБР_ЭффективныеЧасыПоДням.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.Дата = Выборка.РабочийДень;
			МенеджерЗаписи.Сотрудник = Выборка.Сотрудник;
			МенеджерЗаписи.ЭффективныеЧасы = Выборка.ЭффективныеЧасы;
			МенеджерЗаписи.РабочиеЧасы = Выборка.РабочиеЧасы / 3600; 
			МенеджерЗаписи.Записать(Истина);
		КонецЦикла;
	КонецЦикла;	
	
КонецПроцедуры

Процедура ПересчитатьТаблицуВремени(БылиИзменения, ТаблицаДат, Строки, Сотрудник)
	
	БылиИзменения = Ложь;
	Для Каждого Строка Из Строки Цикл
		
		ЗаполнитьЗначенияСвойств(ТаблицаДат.Добавить(), Строка);
		
		Для Каждого Строка2 Из Строки Цикл
			
			Если Строка = Строка2 Тогда
				Продолжить;
			КонецЕсли;
			
			Если (Строка.ДатаНачалаОС <= Строка2.ДатаОкончанияОС) 
				И (Строка.ДатаОкончанияОС >= Строка2.ДатаНачалаОС) Тогда // любое пересечение (и поглощение)
				
				Если (Строка.ДатаНачалаОС > Строка2.ДатаНачалаОС) 
					И (Строка.ДатаОкончанияОС < Строка2.ДатаОкончанияОС) Тогда // поглощение
					Продолжить; // поглощение проверяемой строки, не меняем её
					
				ИначеЕсли (Строка.ДатаНачалаОС < Строка2.ДатаНачалаОС) 
					И (Строка.ДатаОкончанияОС > Строка2.ДатаОкончанияОС) Тогда // поглощение
					
					// наша Строка поглотила Строку2, разбиваем нашу строку на 2 части (создаем запись, вторую просто редачим)
					НоваяСтрока = ТаблицаДат.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
					НоваяСтрока.ДатаНачалаОС = Строка2.ДатаОкончанияОС;
					Строка.ДатаОкончанияОС = Строка2.ДатаНачалаОС;
					БылиИзменения = Истина;
					Возврат;
					
				Иначе // наложение
					
					Если Строка.ДатаНачалаОС < Строка2.ДатаНачалаОС Тогда // изменяем, т.к. она более ранняя
						// у нас наложение, поэтому либо старт либо финиш внутри
						Если Строка2.ДатаНачалаОС < Строка.ДатаНачалаОС И Строка.ДатаНачалаОС < Строка2.ДатаОкончанияОС Тогда
							Строка.ДатаНачалаОС = Строка2.ДатаОкончанияОС;
						ИначеЕсли Строка2.ДатаНачалаОС < Строка.ДатаОкончанияОС И Строка.ДатаОкончанияОС < Строка2.ДатаОкончанияОС Тогда
							Строка.ДатаОкончанияОС = Строка2.ДатаНачалаОС;
						Иначе
							Продолжить;
						КонецЕсли;
						БылиИзменения = Истина;
						Возврат;
					КонецЕсли; // иначе не изменяем
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры

Процедура ЦБР_РеализацияПриПроведенииДокументаОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	
	Если ТипЗнч(Источник) = Тип("ДокументОбъект.cbr_РеализацияТоваровУслугУПР") Тогда   
		Для Каждого Строка ИЗ Источник.Товары Цикл		
			Источник.Движения.ЦБР_ЧасыКлиентов.Записывать = Истина; 
			Источник.Движения.ЦБР_ЧасыКлиентов.Очистить();
			Если Строка.центрБесплатныеЧасыПоНаряду <> 0 Тогда
				Движение = Источник.Движения.ЦБР_ЧасыКлиентов.Добавить();
				Движение.Период        = Источник.Дата;
				Движение.Акт           = Источник.Ссылка;
				Движение.Контрагент    = Источник.Контрагент;  	
				Движение.Менеджер      = Источник.Менеджер;  	
				Движение.ВидЧаса       = Перечисления.ЦБР_ВидыЧасовПоЗадачам.Бесплатные;  	
				Движение.Часы          = Строка.центрБесплатныеЧасыПоНаряду;  	
			ИначеЕсли Строка.центрИТСЧасыПоНаряду <> 0 Тогда
				Движение = Источник.Движения.ЦБР_ЧасыКлиентов.Добавить();
				Движение.Период        = Источник.Дата;
				Движение.Акт           = Источник.Ссылка;
				Движение.Контрагент    = Источник.Контрагент;  	
				Движение.Менеджер      = Источник.Менеджер;  	
				Движение.ВидЧаса       = Перечисления.ЦБР_ВидыЧасовПоЗадачам.ИТС;  	
				Движение.Часы          = Строка.центрИТСЧасыПоНаряду;  	
			ИначеЕсли Строка.центрЧасыПоНаряду <> 0 Тогда
				Движение = Источник.Движения.ЦБР_ЧасыКлиентов.Добавить();
				Движение.Период        = Источник.Дата;
				Движение.Акт           = Источник.Ссылка;
				Движение.Контрагент    = Источник.Контрагент;  	
				Движение.Менеджер      = Источник.Менеджер;  	
				Движение.ВидЧаса       = Перечисления.ЦБР_ВидыЧасовПоЗадачам.Платные;  	
				Движение.Часы          = Строка.центрЧасыПоНаряду;
			КонецЕсли;
		КонецЦикла ;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
